Notes/daily/2021-10-23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-10-23</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-10-23</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-10-29.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1f66f13">Creating a website</a>
<ul>
<li><a href="#orgbc3d4f4">Steps taken</a></li>
<li><a href="#org9b09ab4">Stuff left to do</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1f66f13" class="outline-2">
<h2 id="org1f66f13">Creating a website</h2>
<div class="outline-text-2" id="text-org1f66f13">
<p>
Today is the day I've finally got this website working along with a sitemap (which was a crucial part of this). Here's how the process went:
</p>
</div>

<div id="outline-container-orgbc3d4f4" class="outline-3">
<h3 id="orgbc3d4f4">Steps taken</h3>
<div class="outline-text-3" id="text-orgbc3d4f4">
<ul class="org-ul">
<li>Attempted to use notion, decided on orgmode for better version control support (through git vs on a paid plan that I do not own)</li>
<li>Transferred most files into orgmode, created website builder</li>
<li>Sitemap wouldn't build, spent a long time trying to get it to build</li>
<li>After debugging, I realized that the orgmode version on the github runner was an earlier one that contained a bug, I attempted to install a later version through elpa</li>
<li>I attempted to install a later version through use-package</li>
<li>I decided to install a later version of emacs that came packaged with the correct orgmode</li>
<li>I attempted to install this through flatpak</li>
<li>I installed this through snap; sitemap building worked</li>
<li>I attempted to customize the look of the sitemap page by adding a description, this failed due to strange property issues &amp; the generation of a list in a weird way</li>
<li>I switched to rendering pages in a list rather than in a heading format, this appears to render a lot better</li>
</ul>
</div>
</div>

<div id="outline-container-org9b09ab4" class="outline-3">
<h3 id="org9b09ab4">Stuff left to do</h3>
<div class="outline-text-3" id="text-org9b09ab4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Dates (perhaps modification dates?) on the pages would be nice, currently they just show the titles</li>
<li class="off"><code>[&#xa0;]</code> The rest of the work from notion needs to be transferred over</li>
<li class="off"><code>[&#xa0;]</code> Links to the website need to be added to the class notebook &amp; onedrive folder</li>
<li class="off"><code>[&#xa0;]</code> Links to the sitemap &amp; other useful pages, as well as a short description need to be added to the main homepage</li>
<li class="off"><code>[&#xa0;]</code> The notes homepage should no longer be called homepage</li>
<li class="off"><code>[&#xa0;]</code> Templates should be created for daily diary notes</li>
</ul>

<p>
That's it for now though, it's ~11pm and I'm going to bed, goodnight world!
</p>
</div>
</div>
</div>
</div>
</body>
</html>
